export default {
  state: {
    // 注释 验证类型（类型，位数）
    'nonEmpty': /\S/, // 非空验证（类型不限，位数非0）
    'number': /^[0-9]+$/, // 数字正则验证 (数字0-9，位数不限)
    'phone': /^[0-9]+$/, // 手机号正则验证 (数字0-9，位数不限)
    // 'passWord': /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z_]{8,16}$/, // 密码正则（数字+字母，位数8～15位）
    'passWord': /^(?![0-9]+$)(?![a-zA-Z]+$)(?![`~!@#$%^&*()_+<>?:"{},./;'[\]]+$)[0-9A-Za-z_`~!@#$%^&*()_+<>?:"{},./;'[\]]{8,16}$/, // 密码正则（数字+字母(或特殊字符，位数8～15位）
    'email': /\S/
    // 'email': /^[a-zA-Z0-9]+@[a-zA-Z0-9]+\.[a-zA-Z0-9]+$/ // 邮箱正则（数字+字母，位数不限）

  }
}
